GopalSaraf/Practicals/PSDL/include/proc/pic16lf18877.h
// Register: CWG2AS1
#define CWG2AS1 CWG2AS1
extern volatile unsigned char           CWG2AS1             __at(0x61D);
#ifndef _LIB_BUILD
asm("CWG2AS1 equ 061Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
    };
} CWG2AS1bits_t;
extern volatile CWG2AS1bits_t CWG2AS1bits __at(0x61D);
// bitfield macros
#define _CWG2AS1_AS0E_POSN                                  0x0
#define _CWG2AS1_AS0E_POSITION                              0x0
#define _CWG2AS1_AS0E_SIZE                                  0x1
#define _CWG2AS1_AS0E_LENGTH                                0x1
#define _CWG2AS1_AS0E_MASK                                  0x1
#define _CWG2AS1_AS1E_POSN                                  0x1
#define _CWG2AS1_AS1E_POSITION                              0x1
#define _CWG2AS1_AS1E_SIZE                                  0x1
#define _CWG2AS1_AS1E_LENGTH                                0x1
#define _CWG2AS1_AS1E_MASK                                  0x2
#define _CWG2AS1_AS2E_POSN                                  0x2
#define _CWG2AS1_AS2E_POSITION                              0x2
#define _CWG2AS1_AS2E_SIZE                                  0x1
#define _CWG2AS1_AS2E_LENGTH                                0x1
#define _CWG2AS1_AS2E_MASK                                  0x4
#define _CWG2AS1_AS3E_POSN                                  0x3
#define _CWG2AS1_AS3E_POSITION                              0x3
#define _CWG2AS1_AS3E_SIZE                                  0x1
#define _CWG2AS1_AS3E_LENGTH                                0x1
#define _CWG2AS1_AS3E_MASK                                  0x8
#define _CWG2AS1_AS4E_POSN                                  0x4
#define _CWG2AS1_AS4E_POSITION                              0x4
#define _CWG2AS1_AS4E_SIZE                                  0x1
#define _CWG2AS1_AS4E_LENGTH                                0x1
#define _CWG2AS1_AS4E_MASK                                  0x10
#define _CWG2AS1_AS5E_POSN                                  0x5
#define _CWG2AS1_AS5E_POSITION                              0x5
#define _CWG2AS1_AS5E_SIZE                                  0x1
#define _CWG2AS1_AS5E_LENGTH                                0x1
#define _CWG2AS1_AS5E_MASK                                  0x20
#define _CWG2AS1_AS6E_POSN                                  0x6
#define _CWG2AS1_AS6E_POSITION                              0x6
#define _CWG2AS1_AS6E_SIZE                                  0x1
#define _CWG2AS1_AS6E_LENGTH                                0x1
#define _CWG2AS1_AS6E_MASK                                  0x40

// Register: CWG2STR
#define CWG2STR CWG2STR
extern volatile unsigned char           CWG2STR             __at(0x61E);
#ifndef _LIB_BUILD
asm("CWG2STR equ 061Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned OVRA                   :1;
        unsigned OVRB                   :1;
        unsigned OVRC                   :1;
        unsigned OVRD                   :1;
    };
    struct {
        unsigned CWG2STRA               :1;
        unsigned CWG2STRB               :1;
        unsigned CWG2STRC               :1;
        unsigned CWG2STRD               :1;
        unsigned CWG2OVRA               :1;
        unsigned CWG2OVRB               :1;
        unsigned CWG2OVRC               :1;
        unsigned CWG2OVRD               :1;
    };
} CWG2STRbits_t;
extern volatile CWG2STRbits_t CWG2STRbits __at(0x61E);
// bitfield macros
#define _CWG2STR_STRA_POSN                                  0x0
#define _CWG2STR_STRA_POSITION                              0x0
#define _CWG2STR_STRA_SIZE                                  0x1
#define _CWG2STR_STRA_LENGTH                                0x1
#define _CWG2STR_STRA_MASK                                  0x1
#define _CWG2STR_STRB_POSN                                  0x1
#define _CWG2STR_STRB_POSITION                              0x1
#define _CWG2STR_STRB_SIZE                                  0x1
#define _CWG2STR_STRB_LENGTH                                0x1
#define _CWG2STR_STRB_MASK                                  0x2
#define _CWG2STR_STRC_POSN                                  0x2
#define _CWG2STR_STRC_POSITION                              0x2
#define _CWG2STR_STRC_SIZE                                  0x1
#define _CWG2STR_STRC_LENGTH                                0x1
#define _CWG2STR_STRC_MASK                                  0x4
#define _CWG2STR_STRD_POSN                                  0x3
#define _CWG2STR_STRD_POSITION                              0x3
#define _CWG2STR_STRD_SIZE                                  0x1
#define _CWG2STR_STRD_LENGTH                                0x1
#define _CWG2STR_STRD_MASK                                  0x8
#define _CWG2STR_OVRA_POSN                                  0x4
#define _CWG2STR_OVRA_POSITION                              0x4
#define _CWG2STR_OVRA_SIZE                                  0x1
#define _CWG2STR_OVRA_LENGTH                                0x1
#define _CWG2STR_OVRA_MASK                                  0x10
#define _CWG2STR_OVRB_POSN                                  0x5
#define _CWG2STR_OVRB_POSITION                              0x5
#define _CWG2STR_OVRB_SIZE                                  0x1
#define _CWG2STR_OVRB_LENGTH                                0x1
#define _CWG2STR_OVRB_MASK                                  0x20
#define _CWG2STR_OVRC_POSN                                  0x6
#define _CWG2STR_OVRC_POSITION                              0x6
#define _CWG2STR_OVRC_SIZE                                  0x1
#define _CWG2STR_OVRC_LENGTH                                0x1
#define _CWG2STR_OVRC_MASK                                  0x40
#define _CWG2STR_OVRD_POSN                                  0x7
#define _CWG2STR_OVRD_POSITION                              0x7
#define _CWG2STR_OVRD_SIZE                                  0x1
#define _CWG2STR_OVRD_LENGTH                                0x1
#define _CWG2STR_OVRD_MASK                                  0x80
#define _CWG2STR_CWG2STRA_POSN                              0x0
#define _CWG2STR_CWG2STRA_POSITION                          0x0
#define _CWG2STR_CWG2STRA_SIZE                              0x1
#define _CWG2STR_CWG2STRA_LENGTH                            0x1
#define _CWG2STR_CWG2STRA_MASK                              0x1
#define _CWG2STR_CWG2STRB_POSN                              0x1
#define _CWG2STR_CWG2STRB_POSITION                          0x1
#define _CWG2STR_CWG2STRB_SIZE                              0x1
#define _CWG2STR_CWG2STRB_LENGTH                            0x1
#define _CWG2STR_CWG2STRB_MASK                              0x2
#define _CWG2STR_CWG2STRC_POSN                              0x2
#define _CWG2STR_CWG2STRC_POSITION                          0x2
#define _CWG2STR_CWG2STRC_SIZE                              0x1
#define _CWG2STR_CWG2STRC_LENGTH                            0x1
#define _CWG2STR_CWG2STRC_MASK                              0x4
#define _CWG2STR_CWG2STRD_POSN                              0x3
#define _CWG2STR_CWG2STRD_POSITION                          0x3
#define _CWG2STR_CWG2STRD_SIZE                              0x1
#define _CWG2STR_CWG2STRD_LENGTH                            0x1
#define _CWG2STR_CWG2STRD_MASK                              0x8
#define _CWG2STR_CWG2OVRA_POSN                              0x4
#define _CWG2STR_CWG2OVRA_POSITION                          0x4
#define _CWG2STR_CWG2OVRA_SIZE                              0x1
#define _CWG2STR_CWG2OVRA_LENGTH                            0x1
#define _CWG2STR_CWG2OVRA_MASK                              0x10
#define _CWG2STR_CWG2OVRB_POSN                              0x5
#define _CWG2STR_CWG2OVRB_POSITION                          0x5
#define _CWG2STR_CWG2OVRB_SIZE                              0x1
#define _CWG2STR_CWG2OVRB_LENGTH                            0x1
#define _CWG2STR_CWG2OVRB_MASK                              0x20
#define _CWG2STR_CWG2OVRC_POSN                              0x6
#define _CWG2STR_CWG2OVRC_POSITION                          0x6
#define _CWG2STR_CWG2OVRC_SIZE                              0x1
#define _CWG2STR_CWG2OVRC_LENGTH                            0x1
#define _CWG2STR_CWG2OVRC_MASK                              0x40
#define _CWG2STR_CWG2OVRD_POSN                              0x7
#define _CWG2STR_CWG2OVRD_POSITION                          0x7
#define _CWG2STR_CWG2OVRD_SIZE                              0x1
#define _CWG2STR_CWG2OVRD_LENGTH                            0x1
#define _CWG2STR_CWG2OVRD_MASK                              0x80

// Register: CWG3CLKCON
#define CWG3CLKCON CWG3CLKCON
extern volatile unsigned char           CWG3CLKCON          __at(0x68C);
#ifndef _LIB_BUILD
asm("CWG3CLKCON equ 068Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG3CS                 :1;
    };
} CWG3CLKCONbits_t;
extern volatile CWG3CLKCONbits_t CWG3CLKCONbits __at(0x68C);
// bitfield macros
#define _CWG3CLKCON_CS_POSN                                 0x0
#define _CWG3CLKCON_CS_POSITION                             0x0
#define _CWG3CLKCON_CS_SIZE                                 0x1
#define _CWG3CLKCON_CS_LENGTH                               0x1
#define _CWG3CLKCON_CS_MASK                                 0x1
#define _CWG3CLKCON_CWG3CS_POSN                             0x0
#define _CWG3CLKCON_CWG3CS_POSITION                         0x0
#define _CWG3CLKCON_CWG3CS_SIZE                             0x1
#define _CWG3CLKCON_CWG3CS_LENGTH                           0x1
#define _CWG3CLKCON_CWG3CS_MASK                             0x1

// Register: CWG3ISM
#define CWG3ISM CWG3ISM
extern volatile unsigned char           CWG3ISM             __at(0x68D);
#ifndef _LIB_BUILD
asm("CWG3ISM equ 068Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IS                     :4;
    };
    struct {
        unsigned CWG3ISM0               :1;
        unsigned CWG3ISM1               :1;
        unsigned CWG3ISM2               :1;
        unsigned CWG3ISM3               :1;
    };
} CWG3ISMbits_t;
