GopalSaraf/Practicals/PSDL/include/proc/pic16lf18877.h
// Register: CCDNC
#define CCDNC CCDNC
extern volatile unsigned char           CCDNC               __at(0x1F56);
#ifndef _LIB_BUILD
asm("CCDNC equ 01F56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNC0                 :1;
        unsigned CCDNC1                 :1;
        unsigned CCDNC2                 :1;
        unsigned CCDNC3                 :1;
        unsigned CCDNC4                 :1;
        unsigned CCDNC5                 :1;
        unsigned CCDNC6                 :1;
        unsigned CCDNC7                 :1;
    };
} CCDNCbits_t;
extern volatile CCDNCbits_t CCDNCbits __at(0x1F56);
// bitfield macros
#define _CCDNC_CCDNC0_POSN                                  0x0
#define _CCDNC_CCDNC0_POSITION                              0x0
#define _CCDNC_CCDNC0_SIZE                                  0x1
#define _CCDNC_CCDNC0_LENGTH                                0x1
#define _CCDNC_CCDNC0_MASK                                  0x1
#define _CCDNC_CCDNC1_POSN                                  0x1
#define _CCDNC_CCDNC1_POSITION                              0x1
#define _CCDNC_CCDNC1_SIZE                                  0x1
#define _CCDNC_CCDNC1_LENGTH                                0x1
#define _CCDNC_CCDNC1_MASK                                  0x2
#define _CCDNC_CCDNC2_POSN                                  0x2
#define _CCDNC_CCDNC2_POSITION                              0x2
#define _CCDNC_CCDNC2_SIZE                                  0x1
#define _CCDNC_CCDNC2_LENGTH                                0x1
#define _CCDNC_CCDNC2_MASK                                  0x4
#define _CCDNC_CCDNC3_POSN                                  0x3
#define _CCDNC_CCDNC3_POSITION                              0x3
#define _CCDNC_CCDNC3_SIZE                                  0x1
#define _CCDNC_CCDNC3_LENGTH                                0x1
#define _CCDNC_CCDNC3_MASK                                  0x8
#define _CCDNC_CCDNC4_POSN                                  0x4
#define _CCDNC_CCDNC4_POSITION                              0x4
#define _CCDNC_CCDNC4_SIZE                                  0x1
#define _CCDNC_CCDNC4_LENGTH                                0x1
#define _CCDNC_CCDNC4_MASK                                  0x10
#define _CCDNC_CCDNC5_POSN                                  0x5
#define _CCDNC_CCDNC5_POSITION                              0x5
#define _CCDNC_CCDNC5_SIZE                                  0x1
#define _CCDNC_CCDNC5_LENGTH                                0x1
#define _CCDNC_CCDNC5_MASK                                  0x20
#define _CCDNC_CCDNC6_POSN                                  0x6
#define _CCDNC_CCDNC6_POSITION                              0x6
#define _CCDNC_CCDNC6_SIZE                                  0x1
#define _CCDNC_CCDNC6_LENGTH                                0x1
#define _CCDNC_CCDNC6_MASK                                  0x40
#define _CCDNC_CCDNC7_POSN                                  0x7
#define _CCDNC_CCDNC7_POSITION                              0x7
#define _CCDNC_CCDNC7_SIZE                                  0x1
#define _CCDNC_CCDNC7_LENGTH                                0x1
#define _CCDNC_CCDNC7_MASK                                  0x80

// Register: CCDPC
#define CCDPC CCDPC
extern volatile unsigned char           CCDPC               __at(0x1F57);
#ifndef _LIB_BUILD
asm("CCDPC equ 01F57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPC0                 :1;
        unsigned CCDPC1                 :1;
        unsigned CCDPC2                 :1;
        unsigned CCDPC3                 :1;
        unsigned CCDPC4                 :1;
        unsigned CCDPC5                 :1;
        unsigned CCDPC6                 :1;
        unsigned CCDPC7                 :1;
    };
} CCDPCbits_t;
extern volatile CCDPCbits_t CCDPCbits __at(0x1F57);
// bitfield macros
#define _CCDPC_CCDPC0_POSN                                  0x0
#define _CCDPC_CCDPC0_POSITION                              0x0
#define _CCDPC_CCDPC0_SIZE                                  0x1
#define _CCDPC_CCDPC0_LENGTH                                0x1
#define _CCDPC_CCDPC0_MASK                                  0x1
#define _CCDPC_CCDPC1_POSN                                  0x1
#define _CCDPC_CCDPC1_POSITION                              0x1
#define _CCDPC_CCDPC1_SIZE                                  0x1
#define _CCDPC_CCDPC1_LENGTH                                0x1
#define _CCDPC_CCDPC1_MASK                                  0x2
#define _CCDPC_CCDPC2_POSN                                  0x2
#define _CCDPC_CCDPC2_POSITION                              0x2
#define _CCDPC_CCDPC2_SIZE                                  0x1
#define _CCDPC_CCDPC2_LENGTH                                0x1
#define _CCDPC_CCDPC2_MASK                                  0x4
#define _CCDPC_CCDPC3_POSN                                  0x3
#define _CCDPC_CCDPC3_POSITION                              0x3
#define _CCDPC_CCDPC3_SIZE                                  0x1
#define _CCDPC_CCDPC3_LENGTH                                0x1
#define _CCDPC_CCDPC3_MASK                                  0x8
#define _CCDPC_CCDPC4_POSN                                  0x4
#define _CCDPC_CCDPC4_POSITION                              0x4
#define _CCDPC_CCDPC4_SIZE                                  0x1
#define _CCDPC_CCDPC4_LENGTH                                0x1
#define _CCDPC_CCDPC4_MASK                                  0x10
#define _CCDPC_CCDPC5_POSN                                  0x5
#define _CCDPC_CCDPC5_POSITION                              0x5
#define _CCDPC_CCDPC5_SIZE                                  0x1
#define _CCDPC_CCDPC5_LENGTH                                0x1
#define _CCDPC_CCDPC5_MASK                                  0x20
#define _CCDPC_CCDPC6_POSN                                  0x6
#define _CCDPC_CCDPC6_POSITION                              0x6
#define _CCDPC_CCDPC6_SIZE                                  0x1
#define _CCDPC_CCDPC6_LENGTH                                0x1
#define _CCDPC_CCDPC6_MASK                                  0x40
#define _CCDPC_CCDPC7_POSN                                  0x7
#define _CCDPC_CCDPC7_POSITION                              0x7
#define _CCDPC_CCDPC7_SIZE                                  0x1
#define _CCDPC_CCDPC7_LENGTH                                0x1
#define _CCDPC_CCDPC7_MASK                                  0x80

// Register: ANSELD
#define ANSELD ANSELD
extern volatile unsigned char           ANSELD              __at(0x1F59);
#ifndef _LIB_BUILD
asm("ANSELD equ 01F59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSD0                  :1;
        unsigned ANSD1                  :1;
        unsigned ANSD2                  :1;
        unsigned ANSD3                  :1;
        unsigned ANSD4                  :1;
        unsigned ANSD5                  :1;
        unsigned ANSD6                  :1;
        unsigned ANSD7                  :1;
    };
} ANSELDbits_t;
extern volatile ANSELDbits_t ANSELDbits __at(0x1F59);
// bitfield macros
#define _ANSELD_ANSD0_POSN                                  0x0
#define _ANSELD_ANSD0_POSITION                              0x0
#define _ANSELD_ANSD0_SIZE                                  0x1
#define _ANSELD_ANSD0_LENGTH                                0x1
#define _ANSELD_ANSD0_MASK                                  0x1
#define _ANSELD_ANSD1_POSN                                  0x1
#define _ANSELD_ANSD1_POSITION                              0x1
#define _ANSELD_ANSD1_SIZE                                  0x1
#define _ANSELD_ANSD1_LENGTH                                0x1
#define _ANSELD_ANSD1_MASK                                  0x2
#define _ANSELD_ANSD2_POSN                                  0x2
#define _ANSELD_ANSD2_POSITION                              0x2
#define _ANSELD_ANSD2_SIZE                                  0x1
#define _ANSELD_ANSD2_LENGTH                                0x1
#define _ANSELD_ANSD2_MASK                                  0x4
#define _ANSELD_ANSD3_POSN                                  0x3
#define _ANSELD_ANSD3_POSITION                              0x3
#define _ANSELD_ANSD3_SIZE                                  0x1
#define _ANSELD_ANSD3_LENGTH                                0x1
#define _ANSELD_ANSD3_MASK                                  0x8
#define _ANSELD_ANSD4_POSN                                  0x4
#define _ANSELD_ANSD4_POSITION                              0x4
#define _ANSELD_ANSD4_SIZE                                  0x1
#define _ANSELD_ANSD4_LENGTH                                0x1
#define _ANSELD_ANSD4_MASK                                  0x10
#define _ANSELD_ANSD5_POSN                                  0x5
#define _ANSELD_ANSD5_POSITION                              0x5
#define _ANSELD_ANSD5_SIZE                                  0x1
#define _ANSELD_ANSD5_LENGTH                                0x1
#define _ANSELD_ANSD5_MASK                                  0x20
#define _ANSELD_ANSD6_POSN                                  0x6
#define _ANSELD_ANSD6_POSITION                              0x6
#define _ANSELD_ANSD6_SIZE                                  0x1
#define _ANSELD_ANSD6_LENGTH                                0x1
#define _ANSELD_ANSD6_MASK                                  0x40
#define _ANSELD_ANSD7_POSN                                  0x7
#define _ANSELD_ANSD7_POSITION                              0x7
#define _ANSELD_ANSD7_SIZE                                  0x1
#define _ANSELD_ANSD7_LENGTH                                0x1
#define _ANSELD_ANSD7_MASK                                  0x80

// Register: WPUD
#define WPUD WPUD
extern volatile unsigned char           WPUD                __at(0x1F5A);
#ifndef _LIB_BUILD
asm("WPUD equ 01F5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUD0                  :1;
        unsigned WPUD1                  :1;
        unsigned WPUD2                  :1;
        unsigned WPUD3                  :1;
        unsigned WPUD4                  :1;
        unsigned WPUD5                  :1;
        unsigned WPUD6                  :1;
        unsigned WPUD7                  :1;
    };
} WPUDbits_t;
extern volatile WPUDbits_t WPUDbits __at(0x1F5A);
// bitfield macros
#define _WPUD_WPUD0_POSN                                    0x0
#define _WPUD_WPUD0_POSITION                                0x0
#define _WPUD_WPUD0_SIZE                                    0x1
#define _WPUD_WPUD0_LENGTH                                  0x1
#define _WPUD_WPUD0_MASK                                    0x1
#define _WPUD_WPUD1_POSN                                    0x1
#define _WPUD_WPUD1_POSITION                                0x1
#define _WPUD_WPUD1_SIZE                                    0x1
#define _WPUD_WPUD1_LENGTH                                  0x1
#define _WPUD_WPUD1_MASK                                    0x2
#define _WPUD_WPUD2_POSN                                    0x2
#define _WPUD_WPUD2_POSITION                                0x2
#define _WPUD_WPUD2_SIZE                                    0x1
#define _WPUD_WPUD2_LENGTH                                  0x1
#define _WPUD_WPUD2_MASK                                    0x4
#define _WPUD_WPUD3_POSN                                    0x3
#define _WPUD_WPUD3_POSITION                                0x3
#define _WPUD_WPUD3_SIZE                                    0x1
#define _WPUD_WPUD3_LENGTH                                  0x1
#define _WPUD_WPUD3_MASK                                    0x8
#define _WPUD_WPUD4_POSN                                    0x4
#define _WPUD_WPUD4_POSITION                                0x4
#define _WPUD_WPUD4_SIZE                                    0x1
#define _WPUD_WPUD4_LENGTH                                  0x1
#define _WPUD_WPUD4_MASK                                    0x10
#define _WPUD_WPUD5_POSN                                    0x5
#define _WPUD_WPUD5_POSITION                                0x5
#define _WPUD_WPUD5_SIZE                                    0x1
#define _WPUD_WPUD5_LENGTH                                  0x1
#define _WPUD_WPUD5_MASK                                    0x20
#define _WPUD_WPUD6_POSN                                    0x6
#define _WPUD_WPUD6_POSITION                                0x6
#define _WPUD_WPUD6_SIZE                                    0x1
#define _WPUD_WPUD6_LENGTH                                  0x1
#define _WPUD_WPUD6_MASK                                    0x40
#define _WPUD_WPUD7_POSN                                    0x7
#define _WPUD_WPUD7_POSITION                                0x7
#define _WPUD_WPUD7_SIZE                                    0x1
#define _WPUD_WPUD7_LENGTH                                  0x1
#define _WPUD_WPUD7_MASK                                    0x80

